fio/results/Amazon Web Services/c5d/randread.out
job0: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job1: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job2: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
job3: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
fio-2.14
Starting 4 processes
{
  "fio version" : "fio-2.14",
  "timestamp" : 1583515240,
  "timestamp_ms" : 1583515240327,
  "time" : "Fri Mar  6 17:20:40 2020",
  "global options" : {
    "size" : "100g",
    "rw" : "randread",
    "ioengine" : "libaio",
    "bs" : "4k",
    "nrfiles" : "1",
    "direct" : "1",
    "iodepth" : "128",
    "invalidate" : "1",
    "verify" : "0"
  },
  "jobs" : [
    {
      "jobname" : "job0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 90,
      "job options" : {
        "filename" : "/dev/nvme1n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1176654,
        "iops" : 294163.718750,
        "runtime" : 89115,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 148,
          "mean" : 2.221962,
          "stddev" : 1.815718
        },
        "clat" : {
          "min" : 67,
          "max" : 3968,
          "mean" : 432.542633,
          "stddev" : 183.067886,
          "percentile" : {
            "1.000000" : 131,
            "5.000000" : 227,
            "10.000000" : 302,
            "20.000000" : 342,
            "30.000000" : 362,
            "40.000000" : 378,
            "50.000000" : 398,
            "60.000000" : 418,
            "70.000000" : 446,
            "80.000000" : 494,
            "90.000000" : 596,
            "95.000000" : 724,
            "99.000000" : 1192,
            "99.500000" : 1432,
            "99.900000" : 2008,
            "99.950000" : 2256,
            "99.990000" : 2768,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 69,
          "max" : 3969,
          "mean" : 434.764618,
          "stddev" : 183.119507
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 37.287071,
      "sys_cpu" : 60.314877,
      "ctx" : 92103,
      "majf" : 0,
      "minf" : 138,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.094410,
        "250" : 6.027927,
        "500" : 74.810974,
        "750" : 14.566113,
        "1000" : 2.676884
      },
      "latency_ms" : {
        "2" : 1.720596,
        "4" : 0.103100,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job1",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 90,
      "job options" : {
        "filename" : "/dev/nvme2n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1216233,
        "iops" : 304058.468750,
        "runtime" : 86215,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 149,
          "mean" : 2.195295,
          "stddev" : 1.766656
        },
        "clat" : {
          "min" : 69,
          "max" : 4318,
          "mean" : 418.448822,
          "stddev" : 199.551636,
          "percentile" : {
            "1.000000" : 129,
            "5.000000" : 207,
            "10.000000" : 270,
            "20.000000" : 314,
            "30.000000" : 334,
            "40.000000" : 354,
            "50.000000" : 374,
            "60.000000" : 398,
            "70.000000" : 434,
            "80.000000" : 486,
            "90.000000" : 604,
            "95.000000" : 756,
            "99.000000" : 1256,
            "99.500000" : 1512,
            "99.900000" : 2128,
            "99.950000" : 2352,
            "99.990000" : 2864,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 71,
          "max" : 4320,
          "mean" : 420.644135,
          "stddev" : 199.600174
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 35.779572,
      "sys_cpu" : 61.834503,
      "ctx" : 92150,
      "majf" : 0,
      "minf" : 137,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.079971,
        "250" : 7.693710,
        "500" : 73.903770,
        "750" : 13.249821,
        "1000" : 2.965145
      },
      "latency_ms" : {
        "2" : 1.972595,
        "4" : 0.134758,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job2",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 90,
      "job options" : {
        "filename" : "/dev/nvme3n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1317886,
        "iops" : 329471.500000,
        "runtime" : 79565,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 172,
          "mean" : 1.987837,
          "stddev" : 2.104893
        },
        "clat" : {
          "min" : 70,
          "max" : 4468,
          "mean" : 386.174652,
          "stddev" : 247.663681,
          "percentile" : {
            "1.000000" : 117,
            "5.000000" : 153,
            "10.000000" : 183,
            "20.000000" : 231,
            "30.000000" : 266,
            "40.000000" : 294,
            "50.000000" : 322,
            "60.000000" : 354,
            "70.000000" : 402,
            "80.000000" : 482,
            "90.000000" : 652,
            "95.000000" : 852,
            "99.000000" : 1400,
            "99.500000" : 1656,
            "99.900000" : 2256,
            "99.950000" : 2512,
            "99.990000" : 3120,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 72,
          "max" : 4470,
          "mean" : 388.162506,
          "stddev" : 247.726700
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 39.534210,
      "sys_cpu" : 56.496658,
      "ctx" : 157452,
      "majf" : 0,
      "minf" : 138,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.153046,
        "250" : 24.657295,
        "500" : 56.713432,
        "750" : 11.446884,
        "1000" : 3.876339
      },
      "latency_ms" : {
        "2" : 2.955650,
        "4" : 0.197041,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "job3",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 90,
      "job options" : {
        "filename" : "/dev/nvme4n1"
      },
      "read" : {
        "io_bytes" : 104857600,
        "bw" : 1348165,
        "iops" : 337041.312500,
        "runtime" : 77778,
        "total_ios" : 26214400,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 1,
          "max" : 331,
          "mean" : 2.030000,
          "stddev" : 2.213066
        },
        "clat" : {
          "min" : 70,
          "max" : 5543,
          "mean" : 377.479004,
          "stddev" : 258.678345,
          "percentile" : {
            "1.000000" : 116,
            "5.000000" : 143,
            "10.000000" : 169,
            "20.000000" : 211,
            "30.000000" : 243,
            "40.000000" : 274,
            "50.000000" : 302,
            "60.000000" : 342,
            "70.000000" : 398,
            "80.000000" : 486,
            "90.000000" : 668,
            "95.000000" : 876,
            "99.000000" : 1416,
            "99.500000" : 1672,
            "99.900000" : 2256,
            "99.950000" : 2512,
            "99.990000" : 3120,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 72,
          "max" : 5544,
          "mean" : 379.509003,
          "stddev" : 258.734283
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "write" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "trim" : {
        "io_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0,
            "0.00" : 0,
            "0.00" : 0,
            "0.00" : 0
          }
        },
        "lat" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000
      },
      "usr_cpu" : 33.722050,
      "sys_cpu" : 61.628757,
      "ctx" : 205802,
      "majf" : 0,
      "minf" : 138,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.999756
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.129044,
        "250" : 32.076458,
        "500" : 48.863453,
        "750" : 11.381409,
        "1000" : 4.147346
      },
      "latency_ms" : {
        "2" : 3.202415,
        "4" : 0.198154,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme1n1",
      "read_ios" : 26166103,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 6004230,
      "write_ticks" : 0,
      "in_queue" : 0,
      "util" : 99.919090
    },
    {
      "name" : "nvme2n1",
      "read_ios" : 26201064,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 6433393,
      "write_ticks" : 0,
      "in_queue" : 188,
      "util" : 99.958252
    },
    {
      "name" : "nvme3n1",
      "read_ios" : 26176632,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 7622615,
      "write_ticks" : 0,
      "in_queue" : 224,
      "util" : 99.880486
    },
    {
      "name" : "nvme4n1",
      "read_ios" : 26184679,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 8660119,
      "write_ticks" : 0,
      "in_queue" : 1736,
      "util" : 99.908661
    }
  ]
}

job0: (groupid=0, jobs=1): err= 0: pid=38468: Fri Mar  6 17:20:40 2020
  read : io=102400MB, bw=1149.8MB/s, iops=294163, runt= 89115msec
    slat (usec): min=1, max=148, avg= 2.22, stdev= 1.82
    clat (usec): min=67, max=3968, avg=432.54, stdev=183.07
     lat (usec): min=69, max=3969, avg=434.76, stdev=183.12
    clat percentiles (usec):
     |  1.00th=[  131],  5.00th=[  227], 10.00th=[  302], 20.00th=[  342],
     | 30.00th=[  362], 40.00th=[  378], 50.00th=[  398], 60.00th=[  418],
     | 70.00th=[  446], 80.00th=[  494], 90.00th=[  596], 95.00th=[  724],
     | 99.00th=[ 1192], 99.50th=[ 1432], 99.90th=[ 2008], 99.95th=[ 2256],
     | 99.99th=[ 2768]
    lat (usec) : 100=0.09%, 250=6.03%, 500=74.81%, 750=14.57%, 1000=2.68%
    lat (msec) : 2=1.72%, 4=0.10%
  cpu          : usr=37.29%, sys=60.31%, ctx=92103, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=26214400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job1: (groupid=0, jobs=1): err= 0: pid=38469: Fri Mar  6 17:20:40 2020
  read : io=102400MB, bw=1187.8MB/s, iops=304058, runt= 86215msec
    slat (usec): min=1, max=149, avg= 2.20, stdev= 1.77
    clat (usec): min=69, max=4318, avg=418.45, stdev=199.55
     lat (usec): min=71, max=4320, avg=420.64, stdev=199.60
    clat percentiles (usec):
     |  1.00th=[  129],  5.00th=[  207], 10.00th=[  270], 20.00th=[  314],
     | 30.00th=[  334], 40.00th=[  354], 50.00th=[  374], 60.00th=[  398],
     | 70.00th=[  434], 80.00th=[  486], 90.00th=[  604], 95.00th=[  756],
     | 99.00th=[ 1256], 99.50th=[ 1512], 99.90th=[ 2128], 99.95th=[ 2352],
     | 99.99th=[ 2864]
    lat (usec) : 100=0.08%, 250=7.69%, 500=73.90%, 750=13.25%, 1000=2.97%
    lat (msec) : 2=1.97%, 4=0.13%, 10=0.01%
  cpu          : usr=35.78%, sys=61.83%, ctx=92150, majf=0, minf=137
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=26214400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job2: (groupid=0, jobs=1): err= 0: pid=38470: Fri Mar  6 17:20:40 2020
  read : io=102400MB, bw=1286.2MB/s, iops=329471, runt= 79565msec
    slat (usec): min=1, max=172, avg= 1.99, stdev= 2.10
    clat (usec): min=70, max=4468, avg=386.17, stdev=247.66
     lat (usec): min=72, max=4470, avg=388.16, stdev=247.73
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  153], 10.00th=[  183], 20.00th=[  231],
     | 30.00th=[  266], 40.00th=[  294], 50.00th=[  322], 60.00th=[  354],
     | 70.00th=[  402], 80.00th=[  482], 90.00th=[  652], 95.00th=[  852],
     | 99.00th=[ 1400], 99.50th=[ 1656], 99.90th=[ 2256], 99.95th=[ 2512],
     | 99.99th=[ 3120]
    lat (usec) : 100=0.15%, 250=24.66%, 500=56.71%, 750=11.45%, 1000=3.88%
    lat (msec) : 2=2.96%, 4=0.20%, 10=0.01%
  cpu          : usr=39.53%, sys=56.50%, ctx=157452, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=26214400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
job3: (groupid=0, jobs=1): err= 0: pid=38471: Fri Mar  6 17:20:40 2020
  read : io=102400MB, bw=1316.6MB/s, iops=337041, runt= 77778msec
    slat (usec): min=1, max=331, avg= 2.03, stdev= 2.21
    clat (usec): min=70, max=5543, avg=377.48, stdev=258.68
     lat (usec): min=72, max=5544, avg=379.51, stdev=258.73
    clat percentiles (usec):
     |  1.00th=[  116],  5.00th=[  143], 10.00th=[  169], 20.00th=[  211],
     | 30.00th=[  243], 40.00th=[  274], 50.00th=[  302], 60.00th=[  342],
     | 70.00th=[  398], 80.00th=[  486], 90.00th=[  668], 95.00th=[  876],
     | 99.00th=[ 1416], 99.50th=[ 1672], 99.90th=[ 2256], 99.95th=[ 2512],
     | 99.99th=[ 3120]
    lat (usec) : 100=0.13%, 250=32.08%, 500=48.86%, 750=11.38%, 1000=4.15%
    lat (msec) : 2=3.20%, 4=0.20%, 10=0.01%
  cpu          : usr=33.72%, sys=61.63%, ctx=205802, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=26214400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: io=409600MB, aggrb=4596.4MB/s, minb=1149.8MB/s, maxb=1316.6MB/s, mint=77778msec, maxt=89115msec

Disk stats (read/write):
  nvme1n1: ios=26166103/0, merge=0/0, ticks=6004230/0, in_queue=0, util=99.92%
  nvme2n1: ios=26201064/0, merge=0/0, ticks=6433393/0, in_queue=188, util=99.96%
  nvme3n1: ios=26176632/0, merge=0/0, ticks=7622615/0, in_queue=224, util=99.88%
  nvme4n1: ios=26184679/0, merge=0/0, ticks=8660119/0, in_queue=1736, util=99.91%